         PRINT NOGEN
CONVERT  CSECT ,                                               @V6BD9D1
         ENTRY ASCTOEBC,EBCTOASC
ASCTOEBC DS    0H
         BASE  ASCTOEBC
*
*        PROCEDURE ASCTOEBC(VAR X: CHAR; LEN: INTEGER); EXTERNAL;
*        CONVERTS THE GIVEN STRING FROM ASCII TO EBCDIC.
*
         L     R2,0(,R1)               R2 <- PTR TO DATA BUFFER
         L     R4,4(,R1)               R4 <- LENGTH OF DATA
         LTR   R4,R4
         BZ    ASCOUT                  IF ZERO-LENGTH STRING.
         BCTR  R4,0                    DECREMENT LENGTH FOR EXECUTE.
         EX    R4,A2EINST              TRANSLATE.
ASCOUT   EXIT
A2EINST  TR    0(*-*,R2),A2ETAB
A2ETAB   DC    X'000102030405060708090A0B0C0D0E0F' 0
         DC    X'101112131415161718191A271C1D1E1F' 1
         DC    X'404F7F7B5B6C507D4D5D5C4E6B604B61' 2
         DC    X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F' 3
         DC    X'7CC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6' 4
         DC    X'D7D8D9E2E3E4E5E6E7E8E94AE05A5F6D' 5
         DC    X'79818283848586878889919293949596' 6
         DC    X'979899A2A3A4A5A6A7A8A9C06AD0A107' 7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' F
EBCTOASC DS    0H
         BASE  EBCTOASC
*
*        PROCEDURE EBCTOASC(VAR X: CHAR; LEN: INTEGER); EXTERNAL;
*        CONVERTS THE GIVEN STRING FROM EBCDIC TO ASCII.
*
         L     R2,0(,R1)               R2 <- PTR TO DATA BUFFER
         L     R4,4(,R1)               R4 <- LENGTH OF DATA
         LTR   R4,R4
         BZ    EBCOUT                  IF ZERO-LENGTH STRING.
         BCTR  R4,0                    DECREMENT LENGTH FOR EXECUTE.
         EX    R4,E2AINST              TRANSLATE.
EBCOUT   EXIT
E2AINST  TR    0(*-*,R2),E2ATAB
E2ATAB   DC    X'000102030405060708090A0B0C0D0E0F' 0             ATT.01
         DC    X'101112131415161718191A1B1C1D1E1F' 1             ATT.01
         DC    X'1A1A1A1A1A1A1A1A1A1A1A1A1A1A1A1A' 2             ATT.01
         DC    X'1A1A1A1A1A1A1A1A1A1A1A1A1A1A1A1A' 3             ATT.01
         DC    X'201A1A1A1A1A1A1A1A1A1A2E3C282B7C' 4             ATT.01
         DC    X'261A1A1A1A1A1A1A1A1A21242A293B5E' 5             ATT.01
         DC    X'2D2F1A1A1A1A1A1A1A1A5E2C255F3E3F' 6             ATT.01
         DC    X'1A1A1A1A1A1A1A1A1A603A2340273D22' 7             ATT.01
         DC    X'1A6162636465666768691A1A1A1A1A1A' 8             ATT.01
         DC    X'1A6A6B6C6D6E6F7071721A1A1A1A1A1A' 9             ATT.01
         DC    X'1A7E737475767778797A1A1A1A5B1A1A' A             ATT.01
         DC    X'1A1A1A1A1A1A1A1A1A1A1A1A1A5D1A1A' B             ATT.01
         DC    X'7B4142434445464748491A1A1A1A1A1A' C             ATT.01
         DC    X'7D4A4B4C4D4E4F5051521A1A1A1A1A1A' D             ATT.01
         DC    X'5C1A535455565758595A1A1A1A1A1A1A' E             ATT.01
         DC    X'303132333435363738391A1A1A1A1A1A' F             ATT.01
         REGEQU ,
         END   ,




